<!-- html部分 -->
<template>
	<div>
		<div class="div">	<h1>企业能耗比对比图</h1>
		<ve-line :data="chartData"></ve-line></div>
		<div class="div">	<h1>企业作业量对比图 (单位：万吨)</h1>
		<ve-histogram :data="chartData2"></ve-histogram></div>
		<div class="div">	<h1>企业耗电量对比图 (柱状图)</h1>
		<ve-histogram :data="chartData3"></ve-histogram></div>
		<div class="div">	<h1>企业耗水对比图 (柱状图)</h1>
		<ve-histogram :data="chartData4"></ve-histogram></div>
		<div class="div"><h1>企业耗油量对比图 (柱状图)</h1>
		<ve-histogram :data="chartData5"></ve-histogram></div>
		<div class="div"><h1>设备完好率对比图 (柱状图)</h1>
		<ve-histogram :data="chartData6"></ve-histogram></div>
		 
	
	
	
	
		
		
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'',
		data() {
			return {
				chartData: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 25, '漯河港': 18, '上海港': 35 },
					{ '月份': '2月', '周口港': 22, '漯河港': 19, '上海港': 37 },
					{ '月份': '3月', '周口港': 21, '漯河港': 17, '上海港': 39 },
					{ '月份': '4月', '周口港': 24, '漯河港': 16, '上海港': 32 },
					{ '月份': '5月', '周口港': 28, '漯河港': 14, '上海港': 30 },
					{ '月份': '6月', '周口港': 32, '漯河港': 20, '上海港': 26 },
					{ '月份': '7月', '周口港': 36, '漯河港': 21, '上海港': 24 },
					{ '月份': '8月', '周口港': 39, '漯河港': 23, '上海港': 21 }
					
				  ]
				},
				chartData2: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 25, '漯河港': 18, '上海港': 35 },
					{ '月份': '2月', '周口港': 22, '漯河港': 19, '上海港': 37 },
					{ '月份': '3月', '周口港': 21, '漯河港': 17, '上海港': 39 },
					{ '月份': '4月', '周口港': 56, '漯河港': 16, '上海港': 32 },
					{ '月份': '5月', '周口港': 28, '漯河港': 14, '上海港': 30 },
					{ '月份': '6月', '周口港': 32, '漯河港': 20, '上海港': 26 },
					{ '月份': '7月', '周口港': 36, '漯河港': 21, '上海港': 24 },
					{ '月份': '8月', '周口港': 39, '漯河港': 23, '上海港': 21 }
					
				  ]
				},
				chartData3: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 2500, '漯河港': 667, '上海港': 6767 },
					{ '月份': '2月', '周口港': 2002, '漯河港': 16669, '上海港': 3777 },
					{ '月份': '3月', '周口港': 2100, '漯河港': 15667, '上海港': 3779 },
					{ '月份': '4月', '周口港': 8824, '漯河港': 1566, '上海港': 7777 },
					{ '月份': '5月', '周口港': 2888, '漯河港': 6614, '上海港': 30777 },
					{ '月份': '6月', '周口港': 78, '漯河港': 2066, '上海港': 2765 },
					{ '月份': '7月', '周口港': 888, '漯河港': 2661, '上海港': 2664 },
					{ '月份': '8月', '周口港': 38769, '漯河港': 26663, '上海港': 26561 }
					
				  ]
				},
				chartData4: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 2500, '漯河港': 1998, '上海港': 3935 },
					{ '月份': '2月', '周口港': 2002, '漯河港': 1779, '上海港': 3567 },
					{ '月份': '3月', '周口港': 2100, '漯河港': 1777, '上海港': 3669 },
					{ '月份': '4月', '周口港': 8824, '漯河港': 1676, '上海港': 6362 },
					{ '月份': '5月', '周口港': 2888, '漯河港': 1994, '上海港': 3660 },
					{ '月份': '6月', '周口港': 3562, '漯河港': 9920, '上海港': 2699 },
					{ '月份': '7月', '周口港': 3546, '漯河港': 8921, '上海港': 2994 },
					{ '月份': '8月', '周口港': 3669, '漯河港': 8823, '上海港': 6621 }
					
				  ]
				},
				chartData5: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 2500, '漯河港': 8818, '上海港': 4569 },
					{ '月份': '2月', '周口港': 2002, '漯河港': 8919, '上海港': 9850 },
					{ '月份': '3月', '周口港': 2100, '漯河港': 9817, '上海港': 3589 },
					{ '月份': '4月', '周口港': 8824, '漯河港': 6816, '上海港': 4578 },
					{ '月份': '5月', '周口港': 2888, '漯河港': 1094, '上海港': 8765 },
					{ '月份': '6月', '周口港': 9888, '漯河港': 7000, '上海港': 3459 },
					{ '月份': '7月', '周口港': 3688, '漯河港': 8921, '上海港': 7896 },
					{ '月份': '8月', '周口港': 8839, '漯河港': 9087, '上海港': 5678 }
					
				  ]
				},
				chartData6: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 2500, '漯河港': 18, '上海港': 35 },
					{ '月份': '2月', '周口港': 2002, '漯河港': 19, '上海港': 37 },
					{ '月份': '3月', '周口港': 2100, '漯河港': 17, '上海港': 39 },
					{ '月份': '4月', '周口港': 8824, '漯河港': 16, '上海港': 32 },
					{ '月份': '5月', '周口港': 2888, '漯河港': 14, '上海港': 30 },
					{ '月份': '6月', '周口港': 32, '漯河港': 20, '上海港': 26 },
					{ '月份': '7月', '周口港': 36, '漯河港': 21, '上海港': 24 },
					{ '月份': '8月', '周口港': 39, '漯河港': 23, '上海港': 21 }
					
				  ]
				}
				
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>
.div{
	width: 500px;
	height: 400px;
	display: inline-block;
}
</style>
